БухЭксп/Documents/CW_ОтчетЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ОтчетЭкспедитора</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПеревыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПроведенияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату_Значение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируютсясчетаФактуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияОтбораПриКопировании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗатрат</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьСчетФактура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыВознаграждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_Перевыставление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_Перевыставление</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ОтчетЭкспедитора/Forms/ФормаВыбораГрузоперевозокПоОстаткам/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборИзДокументаОтчетЭкспедитора = Ложь;
	Если Параметры.Свойство("ВыборИзДокументаОтчетЭкспедитора") Тогда
		ВыборИзДокументаОтчетЭкспедитора = Параметры.ВыборИзДокументаОтчетЭкспедитора;
	КонецЕсли;
	
	Если не ВыборИзДокументаОтчетЭкспедитора Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ИспользуютсяЗаказы 			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП
	
	
	ВыборПоЗаказам              = Параметры.ВыборПоЗаказам;
	ВыборПоДокументам 			= Параметры.ВыборПоДокументам;
	ВыборПоГрузоперевозкам 		= Параметры.ВыборПоГрузоперевозкам;
	
	ДатаОстатка 				= Параметры.ДатаОстатка;
	Контрагент    				= Параметры.Контрагент;
	Договор 					= Параметры.Договор;
	
	//Подсистема.УчетПриложенийДоговоров
	ПриложениеКДоговору 		= Параметры.ПриложениеКДоговору;
	//Подсистема.УчетПриложенийДоговоров

	ПодразделениеОрганизации 	= Параметры.ПодразделениеОрганизации;
	
	ЗаполнитьОстатки();
	ЗаполнитьИтоги();
	
	Если ВыборПоЗаказам Тогда
		Элементы.ОстаткиКПеревыставлениюПредставлениеОбъекта.Заголовок = "Заказ";
	КонецЕсли;
	Если ВыборПоГрузоперевозкам Тогда
		Элементы.ОстаткиКПеревыставлениюПредставлениеОбъекта.Заголовок = "Грузоперевозка";
	КонецЕсли;
	Если ВыборПоДокументам Тогда
		Элементы.ОстаткиКПеревыставлениюПредставлениеОбъекта.Заголовок = "Документ расходов";
	КонецЕсли;
	
	Элементы.ОстаткиКПеревыставлению.МножественныйВыбор = Параметры.ЕстьМножественныйВыбор;
	
КонецПроцедуры

#Область Обработчики_Команд_Формы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеСтроки =  Элементы.ОстаткиКПеревыставлению.ВыделенныеСтроки;
	ЭтаФорма.Закрыть(ВыполнитьВыборнаСервере(ВыбранныеСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеСтроки(Команда)
	
	ТекущиеДанные = Элементы.ОстаткиКПеревыставлению.ТекущиеДанные;
	ПоказатьЗначение(,ТекущиеДанные.ОбъектОстатков);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	ЗаполнитьОстатки();
	ЗаполнитьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ОстаткиКПеревыставлениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныеСтроки =  Элементы.ОстаткиКПеревыставлению.ВыделенныеСтроки;
	ЭтаФорма.Закрыть(ВыполнитьВыборнаСервере(ВыбранныеСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиКПеревыставлениюПриАктивизацииСтроки(Элемент)
	ЗаполнитьИтогиВыделенного();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_формы_наСервере

&НаСервере
Процедура ЗаполнитьИтоги()
	
	Итог_Сумма 	= ОстаткиКПеревыставлению.Итог("Сумма")	;
	Итого_НДС 	= ОстаткиКПеревыставлению.Итог("НДС")	;
	Итого_Всего = ОстаткиКПеревыставлению.Итог("Всего")	;
	
	ЗаполнитьИтогиВыделенного();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиВыделенного()
	
	МассивВыделенныхСтрок = Элементы.ОстаткиКПеревыставлению.ВыделенныеСтроки;
	
	Итого_Всего_Выделено = 0;	Итого_НДС_Выделено = 0;	Итог_СуммаВыделено = 0;
	
	Для Каждого Идентификатор из МассивВыделенныхСтрок Цикл
		
		СтрокаТаблицы = ОстаткиКПеревыставлению.НайтиПоИдентификатору(Идентификатор);
		
		Итог_СуммаВыделено		= Итог_СуммаВыделено 	+ СтрокаТаблицы.Сумма;
		Итого_НДС_Выделено  	= Итого_НДС_Выделено 	+ СтрокаТаблицы.НДС;
		Итого_Всего_Выделено 	= Итого_Всего_Выделено 	+ СтрокаТаблицы.Всего;
		
	КонецЦикла;
	
КонецПроцедуры

&наСервере
Процедура ЗаполнитьОстатки()
	
	Запрос = новый Запрос;
	
	Если ВыборПоЗаказам Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.Заказ КАК ОбъектОстатков,
		|	ПРЕДСТАВЛЕНИЕ(РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.Заказ) КАК ПредставлениеОбъекта,";
	КонецЕсли;
	
	Если ВыборПоДокументам Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.ДокументРасходов КАК ОбъектОстатков,
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеОбъекта,";
	КонецЕсли;
	
	Если ВыборПоГрузоперевозкам Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка КАК ОбъектОстатков,
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.CW_Представление КАК ПредставлениеОбъекта,";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "	
	|	СУММА(РегистрНакопленияCW_ПеревыставлениеОстатки.СуммаОстаток) КАК Сумма,
	|	СУММА(РегистрНакопленияCW_ПеревыставлениеОстатки.НДСОстаток) КАК НДС,
	|	СУММА(РегистрНакопленияCW_ПеревыставлениеОстатки.ВсегоОстаток) КАК Всего
	|ИЗ
	|	РегистрНакопления.CW_Перевыставление.Остатки(
	|			&ДатаОстатка,
	|			Контрагент = &Контрагент
	|				И Договор = &Договор
	
	//Подсистема.УчетПриложенийДоговоров
	|				И ПриложениеКДоговору = &ПриложениеКДоговору
	//Подсистема.УчетПриложенийДоговоров
	
	|				И ВЫБОР
	|					КОГДА &ВестиУчетПоПодразделениям
	|						ТОГДА ДокументРасходов.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	
	|) КАК РегистрНакопленияCW_ПеревыставлениеОстатки
	|
	|СГРУППИРОВАТЬ ПО";
	
	

	
	Если ВыборПоГрузоперевозкам Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка";
	КонецЕсли;
	
	Если ВыборПоЗаказам Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.Заказ";
	КонецЕсли;
	
	Если ВыборПоДокументам Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.ДокументРасходов";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОстатка"				, ДатаОстатка);
	Запрос.УстановитьПараметр("Контрагент"				, Контрагент);
	Запрос.УстановитьПараметр("Договор"					, Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору"		, ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОстаткиКПеревыставлению.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьВыборНаСервере(МассивИдентификаторов)
	
	МассивОбъектов = Новый Массив;
	
	Для Каждого  Идентификатор из МассивИдентификаторов Цикл
		
		СтрокаДанных = ОстаткиКПеревыставлению.НайтиПоИдентификатору(Идентификатор);
		МассивОбъектов.Добавить(СтрокаДанных.ОбъектОстатков);
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(МассивОбъектов);	
	
КонецФункции

#КонецОбласти
